Autodesk.Revit.DB.Mechanical.MechanicalFitting.PartType
The part type of the mechanical fitting.

Autodesk.Revit.DB.Mechanical.MechanicalFitting
A mechanical fitting in the Autodesk Revit MEP product.
Remarks: The mechanical fitting is only available in the Autodesk Revit MEP product.